// Generated by jextract

package org.hdfgroup.javahdf5;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     H5L_type_t type;
 *     hbool_t corder_valid;
 *     int64_t corder;
 *     H5T_cset_t cset;
 *     union {
 *         H5O_token_t token;
 *         size_t val_size;
 *     } u;
 * }
 * }
 */
public class H5L_info2_t {

    H5L_info2_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        hdf5_h.C_INT.withName("type"),
        hdf5_h.C_BOOL.withName("corder_valid"),
        MemoryLayout.paddingLayout(3),
        hdf5_h.C_LONG.withName("corder"),
        hdf5_h.C_INT.withName("cset"),
        MemoryLayout.paddingLayout(4),
        H5L_info2_t.u.layout().withName("u")
    ).withName("$anon$87:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * H5L_type_t type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * H5L_type_t type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * H5L_type_t type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * H5L_type_t type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final OfBoolean corder_valid$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("corder_valid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * hbool_t corder_valid
     * }
     */
    public static final OfBoolean corder_valid$layout() {
        return corder_valid$LAYOUT;
    }

    private static final long corder_valid$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * hbool_t corder_valid
     * }
     */
    public static final long corder_valid$offset() {
        return corder_valid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * hbool_t corder_valid
     * }
     */
    public static boolean corder_valid(MemorySegment struct) {
        return struct.get(corder_valid$LAYOUT, corder_valid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * hbool_t corder_valid
     * }
     */
    public static void corder_valid(MemorySegment struct, boolean fieldValue) {
        struct.set(corder_valid$LAYOUT, corder_valid$OFFSET, fieldValue);
    }

    private static final OfLong corder$LAYOUT = (OfLong)$LAYOUT.select(groupElement("corder"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int64_t corder
     * }
     */
    public static final OfLong corder$layout() {
        return corder$LAYOUT;
    }

    private static final long corder$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int64_t corder
     * }
     */
    public static final long corder$offset() {
        return corder$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int64_t corder
     * }
     */
    public static long corder(MemorySegment struct) {
        return struct.get(corder$LAYOUT, corder$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int64_t corder
     * }
     */
    public static void corder(MemorySegment struct, long fieldValue) {
        struct.set(corder$LAYOUT, corder$OFFSET, fieldValue);
    }

    private static final OfInt cset$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * H5T_cset_t cset
     * }
     */
    public static final OfInt cset$layout() {
        return cset$LAYOUT;
    }

    private static final long cset$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * H5T_cset_t cset
     * }
     */
    public static final long cset$offset() {
        return cset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * H5T_cset_t cset
     * }
     */
    public static int cset(MemorySegment struct) {
        return struct.get(cset$LAYOUT, cset$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * H5T_cset_t cset
     * }
     */
    public static void cset(MemorySegment struct, int fieldValue) {
        struct.set(cset$LAYOUT, cset$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * union {
     *     H5O_token_t token;
     *     size_t val_size;
     * }
     * }
     */
    public static class u {

        u() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
            H5O_token_t.layout().withName("token"),
            hdf5_h.C_LONG.withName("val_size")
        ).withName("$anon$92:5");

        /**
         * The layout of this union
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final GroupLayout token$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("token"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * H5O_token_t token
         * }
         */
        public static final GroupLayout token$layout() {
            return token$LAYOUT;
        }

        private static final long token$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * H5O_token_t token
         * }
         */
        public static final long token$offset() {
            return token$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * H5O_token_t token
         * }
         */
        public static MemorySegment token(MemorySegment union) {
            return union.asSlice(token$OFFSET, token$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * H5O_token_t token
         * }
         */
        public static void token(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, token$OFFSET, token$LAYOUT.byteSize());
        }

        private static final OfLong val_size$LAYOUT = (OfLong)$LAYOUT.select(groupElement("val_size"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * size_t val_size
         * }
         */
        public static final OfLong val_size$layout() {
            return val_size$LAYOUT;
        }

        private static final long val_size$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * size_t val_size
         * }
         */
        public static final long val_size$offset() {
            return val_size$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * size_t val_size
         * }
         */
        public static long val_size(MemorySegment union) {
            return union.get(val_size$LAYOUT, val_size$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * size_t val_size
         * }
         */
        public static void val_size(MemorySegment union, long fieldValue) {
            union.set(val_size$LAYOUT, val_size$OFFSET, fieldValue);
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this union
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout u$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("u"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union {
     *     H5O_token_t token;
     *     size_t val_size;
     * } u
     * }
     */
    public static final GroupLayout u$layout() {
        return u$LAYOUT;
    }

    private static final long u$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union {
     *     H5O_token_t token;
     *     size_t val_size;
     * } u
     * }
     */
    public static final long u$offset() {
        return u$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union {
     *     H5O_token_t token;
     *     size_t val_size;
     * } u
     * }
     */
    public static MemorySegment u(MemorySegment struct) {
        return struct.asSlice(u$OFFSET, u$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union {
     *     H5O_token_t token;
     *     size_t val_size;
     * } u
     * }
     */
    public static void u(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, u$OFFSET, u$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

