// Generated by jextract

package org.hdfgroup.javahdf5;

import static java.lang.foreign.MemoryLayout.PathElement.*;
import static java.lang.foreign.ValueLayout.*;

import java.lang.foreign.*;
import java.lang.invoke.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

/**
 * {@snippet lang=c :
 * struct H5VL_file_cont_info_t {
 *     unsigned int version;
 *     uint64_t feature_flags;
 *     size_t token_size;
 *     size_t blob_id_size;
 * }
 * }
 */
public class H5VL_file_cont_info_t {

    H5VL_file_cont_info_t()
    {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT =
        MemoryLayout
            .structLayout(hdf5_h.C_INT.withName("version"), MemoryLayout.paddingLayout(4),
                          hdf5_h.C_LONG.withName("feature_flags"), hdf5_h.C_LONG.withName("token_size"),
                          hdf5_h.C_LONG.withName("blob_id_size"))
            .withName("H5VL_file_cont_info_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() { return $LAYOUT; }

    private static final OfInt version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static final OfInt version$layout() { return version$LAYOUT; }

    private static final long version$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static final long version$offset() { return version$OFFSET; }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static int version(MemorySegment struct) { return struct.get(version$LAYOUT, version$OFFSET); }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int version
     * }
     */
    public static void version(MemorySegment struct, int fieldValue)
    {
        struct.set(version$LAYOUT, version$OFFSET, fieldValue);
    }

    private static final OfLong feature_flags$LAYOUT = (OfLong)$LAYOUT.select(groupElement("feature_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t feature_flags
     * }
     */
    public static final OfLong feature_flags$layout() { return feature_flags$LAYOUT; }

    private static final long feature_flags$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t feature_flags
     * }
     */
    public static final long feature_flags$offset() { return feature_flags$OFFSET; }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t feature_flags
     * }
     */
    public static long feature_flags(MemorySegment struct)
    {
        return struct.get(feature_flags$LAYOUT, feature_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t feature_flags
     * }
     */
    public static void feature_flags(MemorySegment struct, long fieldValue)
    {
        struct.set(feature_flags$LAYOUT, feature_flags$OFFSET, fieldValue);
    }

    private static final OfLong token_size$LAYOUT = (OfLong)$LAYOUT.select(groupElement("token_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t token_size
     * }
     */
    public static final OfLong token_size$layout() { return token_size$LAYOUT; }

    private static final long token_size$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t token_size
     * }
     */
    public static final long token_size$offset() { return token_size$OFFSET; }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t token_size
     * }
     */
    public static long token_size(MemorySegment struct)
    {
        return struct.get(token_size$LAYOUT, token_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t token_size
     * }
     */
    public static void token_size(MemorySegment struct, long fieldValue)
    {
        struct.set(token_size$LAYOUT, token_size$OFFSET, fieldValue);
    }

    private static final OfLong blob_id_size$LAYOUT = (OfLong)$LAYOUT.select(groupElement("blob_id_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t blob_id_size
     * }
     */
    public static final OfLong blob_id_size$layout() { return blob_id_size$LAYOUT; }

    private static final long blob_id_size$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t blob_id_size
     * }
     */
    public static final long blob_id_size$offset() { return blob_id_size$OFFSET; }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t blob_id_size
     * }
     */
    public static long blob_id_size(MemorySegment struct)
    {
        return struct.get(blob_id_size$LAYOUT, blob_id_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t blob_id_size
     * }
     */
    public static void blob_id_size(MemorySegment struct, long fieldValue)
    {
        struct.set(blob_id_size$LAYOUT, blob_id_size$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index)
    {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate(layout()); }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator)
    {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup)
    {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena,
                                            Consumer<MemorySegment> cleanup)
    {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}
