// Generated by jextract

package org.hdfgroup.javahdf5;

import static java.lang.foreign.MemoryLayout.PathElement.*;
import static java.lang.foreign.ValueLayout.*;

import java.lang.foreign.*;
import java.lang.invoke.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

/**
 * {@snippet lang=c :
 * struct H5VL_link_iterate_args_t {
 *     hbool_t recursive;
 *     H5_index_t idx_type;
 *     H5_iter_order_t order;
 *     hsize_t *idx_p;
 *     H5L_iterate2_t op;
 *     void *op_data;
 * }
 * }
 */
public class H5VL_link_iterate_args_t {

    H5VL_link_iterate_args_t()
    {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT =
        MemoryLayout
            .structLayout(hdf5_h.C_BOOL.withName("recursive"), MemoryLayout.paddingLayout(3),
                          hdf5_h.C_INT.withName("idx_type"), hdf5_h.C_INT.withName("order"),
                          MemoryLayout.paddingLayout(4), hdf5_h.C_POINTER.withName("idx_p"),
                          hdf5_h.C_POINTER.withName("op"), hdf5_h.C_POINTER.withName("op_data"))
            .withName("H5VL_link_iterate_args_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() { return $LAYOUT; }

    private static final OfBoolean recursive$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("recursive"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * hbool_t recursive
     * }
     */
    public static final OfBoolean recursive$layout() { return recursive$LAYOUT; }

    private static final long recursive$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * hbool_t recursive
     * }
     */
    public static final long recursive$offset() { return recursive$OFFSET; }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * hbool_t recursive
     * }
     */
    public static boolean recursive(MemorySegment struct)
    {
        return struct.get(recursive$LAYOUT, recursive$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * hbool_t recursive
     * }
     */
    public static void recursive(MemorySegment struct, boolean fieldValue)
    {
        struct.set(recursive$LAYOUT, recursive$OFFSET, fieldValue);
    }

    private static final OfInt idx_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("idx_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * H5_index_t idx_type
     * }
     */
    public static final OfInt idx_type$layout() { return idx_type$LAYOUT; }

    private static final long idx_type$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * H5_index_t idx_type
     * }
     */
    public static final long idx_type$offset() { return idx_type$OFFSET; }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * H5_index_t idx_type
     * }
     */
    public static int idx_type(MemorySegment struct) { return struct.get(idx_type$LAYOUT, idx_type$OFFSET); }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * H5_index_t idx_type
     * }
     */
    public static void idx_type(MemorySegment struct, int fieldValue)
    {
        struct.set(idx_type$LAYOUT, idx_type$OFFSET, fieldValue);
    }

    private static final OfInt order$LAYOUT = (OfInt)$LAYOUT.select(groupElement("order"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * H5_iter_order_t order
     * }
     */
    public static final OfInt order$layout() { return order$LAYOUT; }

    private static final long order$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * H5_iter_order_t order
     * }
     */
    public static final long order$offset() { return order$OFFSET; }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * H5_iter_order_t order
     * }
     */
    public static int order(MemorySegment struct) { return struct.get(order$LAYOUT, order$OFFSET); }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * H5_iter_order_t order
     * }
     */
    public static void order(MemorySegment struct, int fieldValue)
    {
        struct.set(order$LAYOUT, order$OFFSET, fieldValue);
    }

    private static final AddressLayout idx_p$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("idx_p"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * hsize_t *idx_p
     * }
     */
    public static final AddressLayout idx_p$layout() { return idx_p$LAYOUT; }

    private static final long idx_p$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * hsize_t *idx_p
     * }
     */
    public static final long idx_p$offset() { return idx_p$OFFSET; }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * hsize_t *idx_p
     * }
     */
    public static MemorySegment idx_p(MemorySegment struct) { return struct.get(idx_p$LAYOUT, idx_p$OFFSET); }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * hsize_t *idx_p
     * }
     */
    public static void idx_p(MemorySegment struct, MemorySegment fieldValue)
    {
        struct.set(idx_p$LAYOUT, idx_p$OFFSET, fieldValue);
    }

    private static final AddressLayout op$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("op"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * H5L_iterate2_t op
     * }
     */
    public static final AddressLayout op$layout() { return op$LAYOUT; }

    private static final long op$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * H5L_iterate2_t op
     * }
     */
    public static final long op$offset() { return op$OFFSET; }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * H5L_iterate2_t op
     * }
     */
    public static MemorySegment op(MemorySegment struct) { return struct.get(op$LAYOUT, op$OFFSET); }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * H5L_iterate2_t op
     * }
     */
    public static void op(MemorySegment struct, MemorySegment fieldValue)
    {
        struct.set(op$LAYOUT, op$OFFSET, fieldValue);
    }

    private static final AddressLayout op_data$LAYOUT =
        (AddressLayout)$LAYOUT.select(groupElement("op_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *op_data
     * }
     */
    public static final AddressLayout op_data$layout() { return op_data$LAYOUT; }

    private static final long op_data$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *op_data
     * }
     */
    public static final long op_data$offset() { return op_data$OFFSET; }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *op_data
     * }
     */
    public static MemorySegment op_data(MemorySegment struct)
    {
        return struct.get(op_data$LAYOUT, op_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *op_data
     * }
     */
    public static void op_data(MemorySegment struct, MemorySegment fieldValue)
    {
        struct.set(op_data$LAYOUT, op_data$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index)
    {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate(layout()); }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator)
    {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup)
    {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena,
                                            Consumer<MemorySegment> cleanup)
    {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}
