// Generated by jextract

package org.hdfgroup.javahdf5;

import static java.lang.foreign.MemoryLayout.PathElement.*;
import static java.lang.foreign.ValueLayout.*;

import java.lang.foreign.*;
import java.lang.invoke.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

/**
 * {@snippet lang=c :
 * struct H5VL_loc_by_idx {
 *     const char *name;
 *     H5_index_t idx_type;
 *     H5_iter_order_t order;
 *     hsize_t n;
 *     hid_t lapl_id;
 * }
 * }
 */
public class H5VL_loc_by_idx {

    H5VL_loc_by_idx()
    {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT =
        MemoryLayout
            .structLayout(hdf5_h.C_POINTER.withName("name"), hdf5_h.C_INT.withName("idx_type"),
                          hdf5_h.C_INT.withName("order"), hdf5_h.C_LONG.withName("n"),
                          hdf5_h.C_LONG.withName("lapl_id"))
            .withName("H5VL_loc_by_idx");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() { return $LAYOUT; }

    private static final AddressLayout name$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final AddressLayout name$layout() { return name$LAYOUT; }

    private static final long name$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final long name$offset() { return name$OFFSET; }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static MemorySegment name(MemorySegment struct) { return struct.get(name$LAYOUT, name$OFFSET); }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue)
    {
        struct.set(name$LAYOUT, name$OFFSET, fieldValue);
    }

    private static final OfInt idx_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("idx_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * H5_index_t idx_type
     * }
     */
    public static final OfInt idx_type$layout() { return idx_type$LAYOUT; }

    private static final long idx_type$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * H5_index_t idx_type
     * }
     */
    public static final long idx_type$offset() { return idx_type$OFFSET; }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * H5_index_t idx_type
     * }
     */
    public static int idx_type(MemorySegment struct) { return struct.get(idx_type$LAYOUT, idx_type$OFFSET); }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * H5_index_t idx_type
     * }
     */
    public static void idx_type(MemorySegment struct, int fieldValue)
    {
        struct.set(idx_type$LAYOUT, idx_type$OFFSET, fieldValue);
    }

    private static final OfInt order$LAYOUT = (OfInt)$LAYOUT.select(groupElement("order"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * H5_iter_order_t order
     * }
     */
    public static final OfInt order$layout() { return order$LAYOUT; }

    private static final long order$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * H5_iter_order_t order
     * }
     */
    public static final long order$offset() { return order$OFFSET; }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * H5_iter_order_t order
     * }
     */
    public static int order(MemorySegment struct) { return struct.get(order$LAYOUT, order$OFFSET); }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * H5_iter_order_t order
     * }
     */
    public static void order(MemorySegment struct, int fieldValue)
    {
        struct.set(order$LAYOUT, order$OFFSET, fieldValue);
    }

    private static final OfLong n$LAYOUT = (OfLong)$LAYOUT.select(groupElement("n"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * hsize_t n
     * }
     */
    public static final OfLong n$layout() { return n$LAYOUT; }

    private static final long n$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * hsize_t n
     * }
     */
    public static final long n$offset() { return n$OFFSET; }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * hsize_t n
     * }
     */
    public static long n(MemorySegment struct) { return struct.get(n$LAYOUT, n$OFFSET); }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * hsize_t n
     * }
     */
    public static void n(MemorySegment struct, long fieldValue)
    {
        struct.set(n$LAYOUT, n$OFFSET, fieldValue);
    }

    private static final OfLong lapl_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("lapl_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * hid_t lapl_id
     * }
     */
    public static final OfLong lapl_id$layout() { return lapl_id$LAYOUT; }

    private static final long lapl_id$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * hid_t lapl_id
     * }
     */
    public static final long lapl_id$offset() { return lapl_id$OFFSET; }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * hid_t lapl_id
     * }
     */
    public static long lapl_id(MemorySegment struct) { return struct.get(lapl_id$LAYOUT, lapl_id$OFFSET); }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * hid_t lapl_id
     * }
     */
    public static void lapl_id(MemorySegment struct, long fieldValue)
    {
        struct.set(lapl_id$LAYOUT, lapl_id$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index)
    {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate(layout()); }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator)
    {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup)
    {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena,
                                            Consumer<MemorySegment> cleanup)
    {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}
